export const registerRuText = () => {
  return `
📝 *РЕГИСТРАЦИЯ*

Добро пожаловать!  
Для того чтобы вы могли оформить заказы и мы могли с вами связаться, необходимо пройти быструю регистрацию.
`;
};

export const fullNameRuText = () => {
  return `
👤 *Укажите ваше полное имя*

Пожалуйста, введите ваше имя и фамилию так, как вам удобно.
Эта информация будет использоваться при оформлении заказов.

*Пример:*
Иван Иванов
`;
};

export const phoneNumberRuText = () => {
  return `
📞 *Укажите ваш номер телефона*

*Пожалуйста, отправьте ваш номер телефона, чтобы мы могли:*
• связаться с вами для подтверждения заказа  
• уточнить детали доставки  

*Вы можете:*
— ввести номер вручную в международном формате  
— или нажать кнопку «Поделиться контактом» ниже

*Пример:*
+998 90 123 45 67
`;
};

export const registerRuSuccessfullText = () => {
  return `
🎉 *Регистрация успешно завершена !*

*Спасибо за регистрацию* 😊
Теперь вы можете просматривать ассортимент, оформлять заказы
и получать уведомления о статусе ваших заказов.

*Желаем вам приятных покупок* 🍰
`;
};

export const abuotRuUsText = () => {
  return `
🏪 *О НАС*

🍰 Название магазина: Confectionery House
📍 Адрес: г. Ташкент, Юнусабадский район
📞 Телефон: +998 97 192 22 27

Мы — кондитерский магазин, специализирующийся на приготовлении вкусных и качественных сладостей.
Вся наша продукция готовится из натуральных ингредиентов с соблюдением всех санитарных норм.

*У нас вы можете заказать:*
• 🎂 Торты на заказ
• 🧁 Пирожные и десерты
• 🍪 Сладкое печенье
• 🎉 Специальные заказы для праздников и мероприятий

📦 Заказы принимаются заранее  
🚚 Доступна доставка  
💬 По всем вопросам вы можете связаться с нами!

*Будем рады видеть вас* 😊
`;
};

export const settingsRuClientText = () => {
  return `
⚙️ *НАСТРОЙКИ*

*В этом разделе вы можете изменить настройки бота.*

*Здесь вы можете:*
• 🌐 Изменить язык приложения
• 👤 Отредактировать личные данные
• 📞 Обновить номер телефона

*Выберите нужный пункт или воспользуйтесь кнопками ниже 👇*
`;
};

export const editingRuLanguageText = () => {
  return `
🌐 *ИЗМЕНИТЬ ЯЗЫК*

*В этом разделе вы можете изменить язык бота.*

Пожалуйста, выберите удобный для вас язык 👇  
Выбранный язык будет автоматически применён в боте.
`;
};

export const adminRuMenuText = () => {
  return `
🛠️ *ПАНЕЛЬ УПРАВЛЕНИЯ АДМИНИСТРАТОРА*

*Добро пожаловать, Администратор !* 👋  
В этом разделе вы можете полностью управлять работой магазина.

*Здесь вы можете:*
• 📦 Просматривать и управлять заказами
• 👥 Контролировать список клиентов
• 🍰 Добавлять и редактировать товары
• 📊 Просматривать отчёты и статистику
• ⚙️ Управлять системными настройками

*Выберите нужный раздел, используя меню ниже* 👇`;
};

export const productRuMenuText = () => {
  return `
🛒 МЕНЮ ТОВАРОВ

В этом разделе вы можете управлять товарами магазина.

Здесь вы можете:
• ➕ Добавлять новые товары
• ✏️ Редактировать существующие товары
• 🗑️ Удалять ненужные товары

Выберите нужное действие, используя кнопки ниже 👇
`;
};

export const settingsAdminRuMenuText = () => {
  return `
⚙️ *НАСТРОЙКИ АДМИНИСТРАТОРА*

*В этом разделе вы можете управлять настройками панели администратора.*

Здесь вы можете:
• 🌐 Изменить язык бота
• 🔐 Обновить настройки администратора
• ⚙️ Работать с системными параметрами

*Выберите нужный пункт, используя кнопки ниже* 👇
`;
};

export const personalInfoRuText = () => {
  return `
  👤 *ЛИЧНЫЕ ДАННЫЕ*
  
  *В этом разделе вы можете просмотреть и обновить свои личные данные.*
  
  Здесь вы можете:
  • 📝 Обновить имя и фамилию
  • 📞 Изменить номер телефона
  
  *Выберите нужное действие, используя кнопки ниже* 👇`;
};

export const editingPhoneNumberRuText = () => {
  return `
📞 *РЕДАКТИРОВАНИЕ НОМЕРА ТЕЛЕФОНА*

*Пожалуйста, отправьте ваш новый номер телефона.*

Вы можете указать номер в одном из следующих форматов:
• +998 97 123 45 67
• +998971234567
• 998971234567
• 97 123 45 67

*Или воспользуйтесь кнопкой ниже, чтобы отправить номер телефона* 👇`;
};

export const fullNameEditingRuText = () => {
  return `
📝 ОБНОВЛЕНИЕ ИМЕНИ И ФАМИЛИИ

Пожалуйста, отправьте ваше новое имя и фамилию.  

Пример: Иван Иванов`
};

export const fullNameEditingSuccessfullRuText = () => {
  return `
✅ Имя и фамилия успешно обновлены!

Ваши личные данные теперь сохранены в обновлённом виде.`;
};

export const phoneNumberEditingSuccessfullRuText = () => {
  return `
✅ Номер телефона успешно обновлён!

Теперь ваш контактный номер сохранён в системе в обновлённом виде.`;
};